#+title: P0001_data_inspection

#+PROPERTY: header-args:jupyter-python  :tangle   yes
#+PROPERTY: header-args:jupyter-python  :tangle   no

#+PROPERTY: header-args:jupyter-python+ :shebang  "#!/usr/bin/env ipython\n# -*- coding: utf-8 -*-\n\n"
#+PROPERTY: header-args:jupyter-python+ :eval     yes
#+PROPERTY: header-args:jupyter-python+ :comments org
#+PROPERTY: header-args:jupyter-python+ :results  raw drawer pp
#+PROPERTY: header-args:jupyter-python+ :exports  both
#+PROPERTY: header-args:jupyter-python+ :async    yes

#+PROPERTY: header-args:jupyter-python+ :session  python3 :kernel python3
#+PROPERTY: header-args:jupyter-python+ :session  remote_fast8_jiko_at_buka2 :kernel remote_fast8_jiko_at_buka2
#+PROPERTY: header-args:jupyter-python+ :session  local_fast8 :kernel local_fast8


* Boilerplate
** test: Remote on buka2
#+begin_src emacs-lisp :tangle no :eval no
(find-file "/ssh:jiko@buka2:/home/jiko/cc/dev/c2023a/c0501_bertagent_devel/code/p0005_valid-05-part-001-encourage/")
#+end_src

** test: Logger and Location
#+begin_src jupyter-python :async yes :tangle no
import nvm
import srsly
import pathlib
logZ = nvm.Log0()
log0 = logZ.logger
locations = """
stardust7:
  jiko: cc/dev/c2023a/c0501_bertagent_devel/code/p0005_valid-05-part-001-encourage/
buka2:
  jiko: cc/dev/c2023a/c0501_bertagent_devel/code/p0005_valid-05-part-001-encourage/
"""
locations = srsly.yaml_loads(locations)
log0.info(f"{nvm.chdir(locations)}")
#+end_src

** test: Auto reload
#+begin_src jupyter-python :async yes
get_ipython().run_line_magic("load_ext", "autoreload")
get_ipython().run_line_magic("autoreload", "2")
#+end_src

#+RESULTS:

* Imports
** prod: NVM
#+begin_src jupyter-python :async yes
from nvm import disp_df
from nvm import repr_df
from nvm import rdf
from nvm import ddf
from nvm import clean_str
from nvm.aux_str import CLEAN_STR_MAPPINGS_LARGE as maps0
from nvm.aux_str import REGEX_ABC_DASH_XYZ_ASTERISK as re0
from nvm.aux_pandas import fix_column_names
#+end_src

#+RESULTS:

** prod: Basics
#+begin_src jupyter-python :async yes
import os
import pathlib
import numpy as np
import pandas as pd
import re
import json
import yaml
import srsly
import uuid
import random
import numbers
from collections import OrderedDict
from contextlib import ExitStack
import warnings
# warnings.warn("\nwarning")
from hashlib import md5
import humanfriendly as hf
import time
import datetime as dt
from pytz import timezone as tz
tz0 = tz("Europe/Berlin")
from glob import glob
from tqdm import tqdm
import logging
log0.info("DONE: basic imports")
#+end_src

#+RESULTS:
: I: DONE: basic imports

** prod: Extra imports and settings
#+begin_src jupyter-python :async yes
from contexttimer import Timer
import textwrap

HOME = pathlib.Path.home()

tqdm.pandas()

import matplotlib
from matplotlib import pyplot as plt
# import seaborn as sns
# import plotly.graph_objects as go
# import plotly.express as px

# get_ipython().run_line_magic("matplotlib", "qt")
# get_ipython().run_line_magic("matplotlib", "inline")

with Timer() as elapsed:
    time.sleep(0.001)

log0.info(hf.format_timespan(elapsed.elapsed))

log0.info("DONE: extra imports and settings")
#+end_src

#+RESULTS:
#+begin_example
I: 0 seconds
I: DONE: extra imports and settings
#+end_example

* Extra Imports
** prod: More extra imports and settings
#+begin_src jupyter-python :async yes

log0.info("DONE: more extra imports and settings")
#+end_src

#+RESULTS:
: I: DONE: more extra imports and settings

* Notes
** test: Local
** test: Remote
* Process
** prod: Load data
#+begin_src jupyter-python :async yes
dir0 = "../../data/v0004_encourage/osf-arch_2023-04-05-001/Study 2"
dir0 = pathlib.Path(dir0)
# dir0.mkdir(mode=0o700, parents=True, exist_ok=True)
assert dir0.exists(), f"The data directory dir0={str(dir0)} not found!"

name0 = f"Study2_merged_clean.sav"
extn0 = ".sav"

if0 = (dir0/name0).with_suffix(extn0)
log0.info(f"loading: {if0}...")
df0 = pd.read_spss(if0)
log0.info(f"loading: {if0}... DONE")

df0["Text"] = df0.Text.apply(clean_str)

log0.info(f"{df0.shape = }")
disp_df(df0.sample(n=4).sort_index(), width=4544)
#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
I: loading: ../../data/v0004_encourage/osf-arch_2023-04-05-001/Study 2/Study2_merged_clean.sav...
I: loading: ../../data/v0004_encourage/osf-arch_2023-04-05-001/Study 2/Study2_merged_clean.sav... DONE
I: df0.shape = (339, 162)
#+end_example
#+begin_example
              StartDate             EndDate      Status  Progress  Duration__in_seconds_ Finished        RecordedDate         ResponseId  Q_RecaptchaScore Q1.3  Text_nr                                         Text Evaluation_adjective_1 Evaluation_adjective_2 Evaluation_adjective_3 Evaluation_adjective_4 Evaluation_adjective_5 Encouragment2_1 Encouragment2_2                                    Intention Intention_3_TEXT Well_written      Q8 Q8_3_TEXT  Q9                        Q183 Q183_7_TEXT                   Q181                               Q11 Q12                                          Q15                       Q17  Agency_author  Concrete_author  Abstract_author  index0                                        sents  WORD_count  NOUN_count  ADJ_count  VERB_count  VERB_count_without_be_and_have  VB_count  VB_count_without_be_and_have  JJ_count  JJRs_count  JJSs_count  count_of_is_big2a_ag_from_big2  count_of_is_big2b_ag_from_big2  count_of_is_IAV_from_lcm0  count_of_is_DAV_from_lcm0  count_of_is_SV_from_lcm0  count_of_is_IPadj_from_lcm1  count_of_is_IndAdj_from_lcm1                                   concr_info  concr_count  concr_sum  concr_mean  count_of_is_liwc_00001_Function_from_liwc  count_of_is_liwc_00002_Pronoun_from_liwc  count_of_is_liwc_00003_Ppron_from_liwc  count_of_is_liwc_00004_I_from_liwc  count_of_is_liwc_00005_We_from_liwc  count_of_is_liwc_00006_You_from_liwc  count_of_is_liwc_00007_SheHe_from_liwc  count_of_is_liwc_00008_They_from_liwc  count_of_is_liwc_00009_Ipron_from_liwc  count_of_is_liwc_00010_Article_from_liwc  count_of_is_liwc_00011_Prep_from_liwc  count_of_is_liwc_00012_Auxverb_from_liwc  count_of_is_liwc_00013_Adverb_from_liwc  count_of_is_liwc_00014_Conj_from_liwc  count_of_is_liwc_00015_Negate_from_liwc  count_of_is_liwc_00020_Verb_from_liwc  count_of_is_liwc_00021_Adj_from_liwc  count_of_is_liwc_00022_Compare_from_liwc  count_of_is_liwc_00023_Interrog_from_liwc  count_of_is_liwc_00024_Number_from_liwc  count_of_is_liwc_00025_Quant_from_liwc  count_of_is_liwc_00030_Affect_from_liwc  count_of_is_liwc_00031_Posemo_from_liwc  count_of_is_liwc_00032_Negemo_from_liwc  count_of_is_liwc_00033_Anx_from_liwc  count_of_is_liwc_00034_Anger_from_liwc  count_of_is_liwc_00035_Sad_from_liwc  count_of_is_liwc_00040_Social_from_liwc  count_of_is_liwc_00041_Family_from_liwc  count_of_is_liwc_00042_Friend_from_liwc  count_of_is_liwc_00043_Female_from_liwc  count_of_is_liwc_00044_Male_from_liwc  count_of_is_liwc_00050_CogProc_from_liwc  count_of_is_liwc_00051_Insight_from_liwc  count_of_is_liwc_00052_Cause_from_liwc  count_of_is_liwc_00053_Discrep_from_liwc  count_of_is_liwc_00054_Tentat_from_liwc  count_of_is_liwc_00055_Certain_from_liwc  count_of_is_liwc_00056_Differ_from_liwc  count_of_is_liwc_00060_Percept_from_liwc  count_of_is_liwc_00061_See_from_liwc  count_of_is_liwc_00062_Hear_from_liwc  count_of_is_liwc_00063_Feel_from_liwc  count_of_is_liwc_00070_Bio_from_liwc  count_of_is_liwc_00071_Body_from_liwc  count_of_is_liwc_00072_Health_from_liwc  count_of_is_liwc_00073_Sexual_from_liwc  count_of_is_liwc_00074_Ingest_from_liwc  count_of_is_liwc_00080_Drives_from_liwc  count_of_is_liwc_00081_Affiliation_from_liwc  count_of_is_liwc_00082_Achieve_from_liwc  count_of_is_liwc_00083_Power_from_liwc  count_of_is_liwc_00084_Reward_from_liwc  count_of_is_liwc_00085_Risk_from_liwc  count_of_is_liwc_00090_FocusPast_from_liwc  count_of_is_liwc_00091_FocusPresent_from_liwc  count_of_is_liwc_00092_FocusFuture_from_liwc  count_of_is_liwc_00100_Relativ_from_liwc  count_of_is_liwc_00101_Motion_from_liwc  count_of_is_liwc_00102_Space_from_liwc  count_of_is_liwc_00103_Time_from_liwc  count_of_is_liwc_00110_Work_from_liwc  count_of_is_liwc_00111_Leisure_from_liwc  count_of_is_liwc_00112_Home_from_liwc  count_of_is_liwc_00113_Money_from_liwc  count_of_is_liwc_00114_Relig_from_liwc  count_of_is_liwc_00115_Death_from_liwc  count_of_is_liwc_00120_Informal_from_liwc  count_of_is_liwc_00121_Swear_from_liwc  count_of_is_liwc_00122_Netspeak_from_liwc  count_of_is_liwc_00123_Assent_from_liwc  count_of_is_liwc_00124_Nonflu_from_liwc  count_of_is_liwc_00125_Filler_from_liwc  was_good  Filter_1  Filter_2  Filter_3  Filter_4 Filter_general  Check  xxxxxxxxxxxxxxxx         Study Condition  S_D1  C_D2  A_agency  A_concr  A_abstr     N_perc   Adj_perc         V1         V2        V3        V4  Sem_agency       LCM     LCM_R     concr  P_agency  P_concr  P_abstr  P_pers       CondR      Int_R
44  2021-10-30 13:03:15 2021-10-30 13:06:21  IP Address     100.0                  185.0     True 2021-10-30 13:06:21  R_2afzUuy8eGyTs9e               0.9  Yes     59.0  In a thousand years time would you like ...       7 - Very much so                      6       7 - Very much so                      5                      4               6               6  To encourage others to participate in en...              -99            6  Female       -99  40        Undergraduate degree         -99  I am a native speaker  Neither left-wing nor right-wing  No                                          -99  56a4d5532ff2cc0005076903       6.000000              7.0              5.0    64.0  ['In a thousand years time would you lik...       107.0        22.0       11.0        17.0                            16.0       8.0                           6.0      11.0         0.0         0.0                            17.0                             0.0                       10.0                        2.0                       7.0                          0.0                           0.0  [{'In': 3.0}, {'a': 1.46}, {'thousand': ...        101.0     269.55    2.668812                                       57.0                                      18.0                                    13.0                                 0.0                                  1.0                                  11.0                                     0.0                                    1.0                                     5.0                                       8.0                                   12.0                                      13.0                                      1.0                                    5.0                                      2.0                                   16.0                                   6.0                                       1.0                                        3.0                                      2.0                                     3.0                                      2.0                                      2.0                                      0.0                                   0.0                                     0.0                                   0.0                                     15.0                                      1.0                                      0.0                                      0.0                                    0.0                                      15.0                                       1.0                                     5.0                                       4.0                                      2.0                                       1.0                                      5.0                                       2.0                                   1.0                                    0.0                                    1.0                                   1.0                                    0.0                                      1.0                                      0.0                                      0.0                                      5.0                                          1.0                                        0.0                                     2.0                                      0.0                                    2.0                                         0.0                                         16.0                                            1.0                                       23.0                                      7.0                                     9.0                                    7.0                                    0.0                                       0.0                                    1.0                                     0.0                                     0.0                                     0.0                                        0.0                                     0.0                                        0.0                                      0.0                                      0.0                                      0.0       1.0  Selected  Selected       1.0  Selected       Selected    1.0               NaN   Environment       0.0   0.0   0.0  6.000000      7.0      5.0  20.560748  10.280374  15.887850  14.953271  7.476636  5.607477   15.887850  2.263158  2.736842  2.668812  6.666667      5.0      4.0     6.0  Mobilizing  Encourage
47  2021-10-30 13:30:27 2021-10-30 13:37:44  IP Address     100.0                  436.0     True 2021-10-30 13:37:44  R_Or172GxvRjyb8Sl               1.0  Yes     62.0  I feel everyone should be responsible fo...       7 - Very much so                      5                      5                      5                      2               5               4  To share their thoughts about environmen...              -99            5    Male       -99  23  Professional qualification         -99  I am a native speaker  Neither left-wing nor right-wing  No  Interesting study, a comment box regardi...  5ff57775cc4a510008bedc74       6.333333              5.0              6.0    67.0  ['I feel everyone should be responsible ...       125.0        29.0       16.0        22.0                            17.0       9.0                           7.0      15.0         1.0         0.0                            15.0                             0.0                       12.0                        9.0                      10.0                          0.0                           0.0  [{'I': 3.93}, {'feel': 2.28}, {'everyone...        116.0     301.98    2.603276                                       62.0                                      13.0                                     8.0                                 6.0                                  0.0                                   2.0                                     0.0                                    0.0                                     5.0                                      10.0                                   16.0                                      13.0                                      5.0                                    7.0                                      0.0                                   27.0                                   9.0                                       2.0                                        1.0                                      2.0                                     3.0                                      5.0                                      2.0                                      1.0                                   0.0                                     0.0                                   0.0                                      9.0                                      0.0                                      0.0                                      0.0                                    0.0                                      26.0                                       4.0                                     8.0                                       4.0                                      6.0                                       4.0                                      2.0                                       3.0                                   2.0                                    0.0                                    1.0                                   0.0                                    0.0                                      0.0                                      0.0                                      0.0                                      7.0                                          0.0                                        1.0                                     5.0                                      0.0                                    1.0                                         1.0                                         26.0                                            0.0                                       35.0                                     12.0                                    17.0                                    5.0                                    2.0                                       0.0                                    2.0                                     0.0                                     0.0                                     0.0                                        0.0                                     0.0                                        0.0                                      0.0                                      0.0                                      0.0       1.0  Selected  Selected       1.0  Selected       Selected    1.0               NaN   Environment       1.0   0.0   1.0  6.333333      5.0      6.0  23.200000  12.800000  17.600000  13.600000  7.200000  5.600000   12.000000  2.032258  2.967742  2.603276  5.666667      5.0      2.0     4.5   Informing    Express
115 2021-10-30 12:20:15 2021-10-30 12:22:40  IP Address     100.0                  145.0     True 2021-10-30 12:22:41  R_11cLLyIO6ejp4Pk               0.9  Yes    140.0  By participating in environmental action...                      4                      4                      4                      4                      4               4               4  To encourage others to participate in en...              -99            4  Female       -99  40         Secondary education         -99  I am a native speaker  Neither left-wing nor right-wing  No                                          -99  6151e94ff9b7a6a933b86c00       5.666667              7.0              7.0   156.0  ['By participating in environmental acti...        93.0        17.0        4.0        17.0                            14.0       8.0                           7.0       3.0         1.0         0.0                             9.0                             0.0                        9.0                        4.0                       4.0                          0.0                           0.0  [{'By': 1.55}, {'in': 3.0}, {'environmen...         86.0     201.85    2.347093                                       56.0                                      13.0                                    12.0                                 0.0                                  9.0                                   1.0                                     0.0                                    2.0                                     1.0                                       8.0                                   13.0                                      11.0                                      2.0                                    9.0                                      2.0                                   18.0                                   2.0                                       2.0                                        1.0                                      0.0                                     2.0                                      5.0                                      1.0                                      4.0                                   0.0                                     1.0                                   0.0                                     13.0                                      0.0                                      0.0                                      0.0                                    0.0                                      16.0                                       1.0                                     6.0                                       4.0                                      1.0                                       2.0                                      4.0                                       1.0                                   0.0                                    0.0                                    1.0                                   1.0                                    1.0                                      0.0                                      0.0                                      0.0                                     12.0                                          9.0                                        0.0                                     1.0                                      1.0                                    1.0                                         3.0                                         17.0                                            5.0                                       19.0                                      6.0                                     6.0                                    7.0                                    1.0                                       0.0                                    0.0                                     0.0                                     0.0                                     1.0                                        0.0                                     0.0                                        0.0                                      0.0                                      0.0                                      0.0       1.0  Selected  Selected       1.0  Selected       Selected    1.0               NaN   Environment       0.0   0.0   0.0  5.666667      7.0      7.0  18.279570   4.301075  18.279570  15.053763  8.602151  7.526882    9.677419  2.000000  3.000000  2.347093  4.000000      4.0      4.0     4.0  Mobilizing  Encourage
317 2021-12-06 11:41:21 2021-12-06 11:46:09  IP Address     100.0                  287.0     True 2021-12-06 11:46:09  R_C2oUqWRdWwORovn               1.0  Yes    212.0  as an individual , I feel that our areas...                      5                      6                      6                      5                      5               5               5  To share their thoughts about environmen...              -99            6  Female       -99  28         Vocational training         -99  I am a native speaker  Neither left-wing nor right-wing  No                                         nope  5b5796938c7d400001da9ab7       6.000000              5.0              4.0   414.0  ['as an individual , I feel that our are...       106.0        22.0        5.0        21.0                            21.0       9.0                           9.0       4.0         1.0         0.0                             6.0                             0.0                       11.0                        8.0                       4.0                          0.0                           0.0  [{'as': 1.33}, {'an': 1.46}, {'individua...         91.0     226.46    2.488571                                       59.0                                      21.0                                    11.0                                 5.0                                  1.0                                   0.0                                     0.0                                    5.0                                    10.0                                       6.0                                   16.0                                       8.0                                      5.0                                    6.0                                      1.0                                   20.0                                   4.0                                       2.0                                        3.0                                      0.0                                     2.0                                     10.0                                     10.0                                      0.0                                   0.0                                     0.0                                   0.0                                     23.0                                      0.0                                      0.0                                      0.0                                    0.0                                      14.0                                       3.0                                     1.0                                       4.0                                      2.0                                       2.0                                      3.0                                       6.0                                   1.0                                    0.0                                    5.0                                   5.0                                    2.0                                      2.0                                      0.0                                      1.0                                      9.0                                          8.0                                        0.0                                     7.0                                      0.0                                    0.0                                         1.0                                         14.0                                            4.0                                       15.0                                      0.0                                    12.0                                    3.0                                    2.0                                       0.0                                    0.0                                     0.0                                     0.0                                     0.0                                        0.0                                     0.0                                        0.0                                      0.0                                      0.0                                      0.0       1.0  Selected  Selected       1.0  Selected       Selected    1.0               NaN  Volunteering       1.0   1.0   1.0  6.000000      5.0      4.0  20.754717   4.716981  19.811321  19.811321  8.490566  8.490566    5.660377  1.826087  3.173913  2.488571  5.666667      5.0      5.0     5.0   Informing    Express
#+end_example
:END:
** Cols
#+begin_src jupyter-python :async yes
for col0 in df0.columns:
    print(f"    \"{col0}\",")
#+end_src

#+RESULTS:
#+begin_example
    "StartDate",
    "EndDate",
    "Status",
    "Progress",
    "Duration__in_seconds_",
    "Finished",
    "RecordedDate",
    "ResponseId",
    "Q_RecaptchaScore",
    "Q1.3",
    "Text_nr",
    "Text",
    "Evaluation_adjective_1",
    "Evaluation_adjective_2",
    "Evaluation_adjective_3",
    "Evaluation_adjective_4",
    "Evaluation_adjective_5",
    "Encouragment2_1",
    "Encouragment2_2",
    "Intention",
    "Intention_3_TEXT",
    "Well_written",
    "Q8",
    "Q8_3_TEXT",
    "Q9",
    "Q183",
    "Q183_7_TEXT",
    "Q181",
    "Q11",
    "Q12",
    "Q15",
    "Q17",
    "Agency_author",
    "Concrete_author",
    "Abstract_author",
    "index0",
    "sents",
    "WORD_count",
    "NOUN_count",
    "ADJ_count",
    "VERB_count",
    "VERB_count_without_be_and_have",
    "VB_count",
    "VB_count_without_be_and_have",
    "JJ_count",
    "JJRs_count",
    "JJSs_count",
    "count_of_is_big2a_ag_from_big2",
    "count_of_is_big2b_ag_from_big2",
    "count_of_is_IAV_from_lcm0",
    "count_of_is_DAV_from_lcm0",
    "count_of_is_SV_from_lcm0",
    "count_of_is_IPadj_from_lcm1",
    "count_of_is_IndAdj_from_lcm1",
    "concr_info",
    "concr_count",
    "concr_sum",
    "concr_mean",
    "count_of_is_liwc_00001_Function_from_liwc",
    "count_of_is_liwc_00002_Pronoun_from_liwc",
    "count_of_is_liwc_00003_Ppron_from_liwc",
    "count_of_is_liwc_00004_I_from_liwc",
    "count_of_is_liwc_00005_We_from_liwc",
    "count_of_is_liwc_00006_You_from_liwc",
    "count_of_is_liwc_00007_SheHe_from_liwc",
    "count_of_is_liwc_00008_They_from_liwc",
    "count_of_is_liwc_00009_Ipron_from_liwc",
    "count_of_is_liwc_00010_Article_from_liwc",
    "count_of_is_liwc_00011_Prep_from_liwc",
    "count_of_is_liwc_00012_Auxverb_from_liwc",
    "count_of_is_liwc_00013_Adverb_from_liwc",
    "count_of_is_liwc_00014_Conj_from_liwc",
    "count_of_is_liwc_00015_Negate_from_liwc",
    "count_of_is_liwc_00020_Verb_from_liwc",
    "count_of_is_liwc_00021_Adj_from_liwc",
    "count_of_is_liwc_00022_Compare_from_liwc",
    "count_of_is_liwc_00023_Interrog_from_liwc",
    "count_of_is_liwc_00024_Number_from_liwc",
    "count_of_is_liwc_00025_Quant_from_liwc",
    "count_of_is_liwc_00030_Affect_from_liwc",
    "count_of_is_liwc_00031_Posemo_from_liwc",
    "count_of_is_liwc_00032_Negemo_from_liwc",
    "count_of_is_liwc_00033_Anx_from_liwc",
    "count_of_is_liwc_00034_Anger_from_liwc",
    "count_of_is_liwc_00035_Sad_from_liwc",
    "count_of_is_liwc_00040_Social_from_liwc",
    "count_of_is_liwc_00041_Family_from_liwc",
    "count_of_is_liwc_00042_Friend_from_liwc",
    "count_of_is_liwc_00043_Female_from_liwc",
    "count_of_is_liwc_00044_Male_from_liwc",
    "count_of_is_liwc_00050_CogProc_from_liwc",
    "count_of_is_liwc_00051_Insight_from_liwc",
    "count_of_is_liwc_00052_Cause_from_liwc",
    "count_of_is_liwc_00053_Discrep_from_liwc",
    "count_of_is_liwc_00054_Tentat_from_liwc",
    "count_of_is_liwc_00055_Certain_from_liwc",
    "count_of_is_liwc_00056_Differ_from_liwc",
    "count_of_is_liwc_00060_Percept_from_liwc",
    "count_of_is_liwc_00061_See_from_liwc",
    "count_of_is_liwc_00062_Hear_from_liwc",
    "count_of_is_liwc_00063_Feel_from_liwc",
    "count_of_is_liwc_00070_Bio_from_liwc",
    "count_of_is_liwc_00071_Body_from_liwc",
    "count_of_is_liwc_00072_Health_from_liwc",
    "count_of_is_liwc_00073_Sexual_from_liwc",
    "count_of_is_liwc_00074_Ingest_from_liwc",
    "count_of_is_liwc_00080_Drives_from_liwc",
    "count_of_is_liwc_00081_Affiliation_from_liwc",
    "count_of_is_liwc_00082_Achieve_from_liwc",
    "count_of_is_liwc_00083_Power_from_liwc",
    "count_of_is_liwc_00084_Reward_from_liwc",
    "count_of_is_liwc_00085_Risk_from_liwc",
    "count_of_is_liwc_00090_FocusPast_from_liwc",
    "count_of_is_liwc_00091_FocusPresent_from_liwc",
    "count_of_is_liwc_00092_FocusFuture_from_liwc",
    "count_of_is_liwc_00100_Relativ_from_liwc",
    "count_of_is_liwc_00101_Motion_from_liwc",
    "count_of_is_liwc_00102_Space_from_liwc",
    "count_of_is_liwc_00103_Time_from_liwc",
    "count_of_is_liwc_00110_Work_from_liwc",
    "count_of_is_liwc_00111_Leisure_from_liwc",
    "count_of_is_liwc_00112_Home_from_liwc",
    "count_of_is_liwc_00113_Money_from_liwc",
    "count_of_is_liwc_00114_Relig_from_liwc",
    "count_of_is_liwc_00115_Death_from_liwc",
    "count_of_is_liwc_00120_Informal_from_liwc",
    "count_of_is_liwc_00121_Swear_from_liwc",
    "count_of_is_liwc_00122_Netspeak_from_liwc",
    "count_of_is_liwc_00123_Assent_from_liwc",
    "count_of_is_liwc_00124_Nonflu_from_liwc",
    "count_of_is_liwc_00125_Filler_from_liwc",
    "was_good",
    "Filter_1",
    "Filter_2",
    "Filter_3",
    "Filter_4",
    "Filter_general",
    "Check",
    "xxxxxxxxxxxxxxxx",
    "Study",
    "Condition",
    "S_D1",
    "C_D2",
    "A_agency",
    "A_concr",
    "A_abstr",
    "N_perc",
    "Adj_perc",
    "V1",
    "V2",
    "V3",
    "V4",
    "Sem_agency",
    "LCM",
    "LCM_R",
    "concr",
    "P_agency",
    "P_concr",
    "P_abstr",
    "P_pers",
    "CondR",
    "Int_R",
#+end_example

** Unique
#+begin_src jupyter-python :async yes
df0.Q17.is_unique
#+end_src

#+RESULTS:
: True

** Recode
#+begin_src jupyter-python :async yes
dir0 = "../../data/v0004_encourage/"
dir0 = pathlib.Path(dir0)
# dir0.mkdir(mode=0o700, parents=True, exist_ok=True)
assert dir0.exists(), f"The data directory dir0={str(dir0)} not found!"


"""
    "V1",
    "V2",
    "V3",
    "V4",
    "LCM",
    "LCM_R",
"""

map0 = {
    "id0": "Q17",
    "verb index": "V4",
    "concreteness": "concr_mean",
    "concr raw": "concr",
    "semantic agency": "Sem_agency",
    "meta agency": "A_agency",
    "meta concreteness": "A_concr",
    "meta abstractness": "A_abstr",
    "condition": "Condition",
    "condR": "CondR",
    "context": "Study",
    # "english": "English",
    "english": "Q181",
    # "gender": "Gender",
    "gender": "Q8",
    # "age": "Age",
    "age": "Q9",
    "was_good": "was_good",
    "filter_1": "Filter_1",
    "filter_2": "Filter_2",
    "filter_3": "Filter_3",
    "filter_4": "Filter_4",
    "filter_general": "Filter_general",
    "check": "Check",
    "text": "Text",
}
for key, val in map0.items():
    df0[key] = df0[val]

cols2 = [*list(map0.keys())]

df2 = df0[cols2].copy()

df2.insert(8, "study", "s02")

df2.to_pickle(dir0/"Study02_super-clean.pkl")
df2.to_csv(dir0/"Study02_super-clean.csv", index=False)
log0.info(f"{df2.shape = }")
disp_df(df2.sample(n=4).sort_index(), width=4444)
#+end_src

#+RESULTS:
:RESULTS:
: I: df2.shape = (339, 23)
#+begin_example
                          id0  verb index  concreteness  concr raw  semantic agency  meta agency  meta concreteness  meta abstractness study condition       condR       context                english  gender age  was_good  filter_1  filter_2  filter_3  filter_4 filter_general  check                                         text
64   5e3e2fdc598f3f0a3b108106    7.142857      2.448915   2.448915        10.000000     7.000000                5.0                7.0   s02       0.0  Mobilizing   Environment  I am a native speaker    Male  25       1.0  Selected  Selected       1.0  Selected       Selected    1.0  The topic of global warming is spoken ab...
186  5c618c3e821b4e000130d1a6    2.884615      2.261739   2.261739         6.730769     3.333333                4.0                5.0   s02       1.0   Informing  Volunteering  I am a native speaker    Male  53       1.0  Selected  Selected       1.0  Selected       Selected    1.0  I think that volunteering overall is not...
299  5ea96886ef7ece0604eee527    9.917355      2.299091   2.299091        16.528926     5.666667                6.0                5.0   s02       1.0   Informing  Volunteering  I am a native speaker    Male  60       1.0  Selected  Selected       1.0  Selected       Selected    1.0  Volunteering is a fantastic way to impro...
334  59d5373a719adb0001235cae    3.960396      2.154419   2.154419         3.960396     6.333333                6.0                6.0   s02       1.0   Informing  Volunteering  I am a native speaker  Female  42       1.0  Selected  Selected       1.0  Selected       Selected    1.0  Volunteering is regarded as an act of al...
#+end_example
:END:

** Checkup value counts
#+begin_src jupyter-python :async yes
df2.english.value_counts(dropna=False)
#+end_src

#+RESULTS:
#+begin_example
english
I am a native speaker    339
Name: count, dtype: int64
#+end_example

** Checkup correlations
#+begin_src jupyter-python :async yes
numerics = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']
df4 = df2.select_dtypes(include=numerics)

cr2 = df4.corr()
disp_df(cr2["verb index"], max_rows=444)
#+end_src

#+RESULTS:
#+begin_example
verb index           1.000000
concreteness         0.393215
concr raw            0.393215
semantic agency      0.365455
meta agency          0.036644
meta concreteness   -0.064330
meta abstractness   -0.046484
was_good                  NaN
filter_3                  NaN
check                     NaN
Name: verb index, dtype: float64
#+end_example
